# ####################################################################

#  Created by Genus(TM) Synthesis Solution 18.14-s037_1 on Mon May 25 14:37:47 CDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1.0fF
set_units -time 1000.0ps

# Set the current design
current_design memory_module

create_clock -name "CLK" -period 1.0 -waveform {0.0 0.5} [get_ports CLK]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[7]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[7]}]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[6]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[6]}]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[5]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[5]}]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[4]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[4]}]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[3]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[3]}]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[2]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[2]}]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[1]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[1]}]
set_load -pin_load -min 0.0 [get_ports {OUTPUT[0]}]
set_load -pin_load -max 0.1 [get_ports {OUTPUT[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports RSTB]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports WE]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports CE]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports SEQ]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {ADDRESS[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {INPUT[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.2 [get_ports {OUTPUT[0]}]
set_max_transition 0.1 [current_design]
set_max_capacitance 0.0 [get_ports CLK]
set_max_capacitance 0.0 [get_ports RSTB]
set_max_capacitance 0.0 [get_ports WE]
set_max_capacitance 0.0 [get_ports CE]
set_max_capacitance 0.0 [get_ports SEQ]
set_max_capacitance 0.0 [get_ports {ADDRESS[7]}]
set_max_capacitance 0.0 [get_ports {ADDRESS[6]}]
set_max_capacitance 0.0 [get_ports {ADDRESS[5]}]
set_max_capacitance 0.0 [get_ports {ADDRESS[4]}]
set_max_capacitance 0.0 [get_ports {ADDRESS[3]}]
set_max_capacitance 0.0 [get_ports {ADDRESS[2]}]
set_max_capacitance 0.0 [get_ports {ADDRESS[1]}]
set_max_capacitance 0.0 [get_ports {ADDRESS[0]}]
set_max_capacitance 0.0 [get_ports {INPUT[7]}]
set_max_capacitance 0.0 [get_ports {INPUT[6]}]
set_max_capacitance 0.0 [get_ports {INPUT[5]}]
set_max_capacitance 0.0 [get_ports {INPUT[4]}]
set_max_capacitance 0.0 [get_ports {INPUT[3]}]
set_max_capacitance 0.0 [get_ports {INPUT[2]}]
set_max_capacitance 0.0 [get_ports {INPUT[1]}]
set_max_capacitance 0.0 [get_ports {INPUT[0]}]
set_dont_use [get_lib_cells NangateOpenCellLibrary/ANTENNA_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X2]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X4]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X8]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X16]
set_dont_use [get_lib_cells NangateOpenCellLibrary/FILLCELL_X32]
set_dont_use [get_lib_cells NangateOpenCellLibrary/LOGIC0_X1]
set_dont_use [get_lib_cells NangateOpenCellLibrary/LOGIC1_X1]
set_clock_uncertainty -setup 0.05 [get_clocks CLK]
set_clock_uncertainty -hold 0.05 [get_clocks CLK]
